---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleTapping
source: html/ebc7ccd4-6666-dd58-d37e-e73d98d41c80.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleTapping Property

"Right-handed thread"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleTapping { get; }
```